qmk/ChibiOS/os/hal/ports/STM32/STM32U5xx/clocktree.h
#define RCC_CCIPR1_LPTIM2SEL_PCLK1          ((0U) << 18U)
#define RCC_CCIPR1_LPTIM2SEL_LSI            ((1U) << 18U)
#define RCC_CCIPR1_LPTIM2SEL_HSI16          ((2U) << 18U)
#define RCC_CCIPR1_LPTIM2SEL_LSE            ((3U) << 18U)

#define RCC_CCIPR3_LPTIM34SEL_MSIK          ((0U) << 8U)
#define RCC_CCIPR3_LPTIM34SEL_LSI           ((1U) << 8U)
#define RCC_CCIPR3_LPTIM34SEL_HSI16         ((2U) << 8U)
#define RCC_CCIPR3_LPTIM34SEL_LSE           ((3U) << 8U)
/** @} */

/**
 * @name    Generated scaler selector constants
 * @{
 */
#define RCC_ICSCR1_MSISRANGE_DIV1           ((0U) << 28U)
#define RCC_ICSCR1_MSISRANGE_DIV2           ((1U) << 28U)
#define RCC_ICSCR1_MSISRANGE_DIV3           ((2U) << 28U)
#define RCC_ICSCR1_MSISRANGE_DIV4           ((3U) << 28U)

#define RCC_ICSCR1_MSIKRANGE_DIV1           ((0U) << 24U)
#define RCC_ICSCR1_MSIKRANGE_DIV2           ((1U) << 24U)
#define RCC_ICSCR1_MSIKRANGE_DIV3           ((2U) << 24U)
#define RCC_ICSCR1_MSIKRANGE_DIV4           ((3U) << 24U)

#define RCC_CFGR2_HPRE_DIV1                 ((0U) << 0U)
#define RCC_CFGR2_HPRE_DIV2                 ((8U) << 0U)
#define RCC_CFGR2_HPRE_DIV4                 ((9U) << 0U)
#define RCC_CFGR2_HPRE_DIV8                 ((10U) << 0U)
#define RCC_CFGR2_HPRE_DIV16                ((11U) << 0U)
#define RCC_CFGR2_HPRE_DIV64                ((12U) << 0U)
#define RCC_CFGR2_HPRE_DIV128               ((13U) << 0U)
#define RCC_CFGR2_HPRE_DIV256               ((14U) << 0U)
#define RCC_CFGR2_HPRE_DIV512               ((15U) << 0U)

#define RCC_CFGR2_PPRE1_DIV1                ((0U) << 4U)
#define RCC_CFGR2_PPRE1_DIV2                ((4U) << 4U)
#define RCC_CFGR2_PPRE1_DIV4                ((5U) << 4U)
#define RCC_CFGR2_PPRE1_DIV8                ((6U) << 4U)
#define RCC_CFGR2_PPRE1_DIV16               ((7U) << 4U)

#define RCC_CFGR2_PPRE2_DIV1                ((0U) << 8U)
#define RCC_CFGR2_PPRE2_DIV2                ((4U) << 8U)
#define RCC_CFGR2_PPRE2_DIV4                ((5U) << 8U)
#define RCC_CFGR2_PPRE2_DIV8                ((6U) << 8U)
#define RCC_CFGR2_PPRE2_DIV16               ((7U) << 8U)

#define RCC_CFGR3_PPRE3_DIV1                ((0U) << 4U)
#define RCC_CFGR3_PPRE3_DIV2                ((4U) << 4U)
#define RCC_CFGR3_PPRE3_DIV4                ((5U) << 4U)
#define RCC_CFGR3_PPRE3_DIV8                ((6U) << 4U)
#define RCC_CFGR3_PPRE3_DIV16               ((7U) << 4U)
/** @} */

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @name    Clock tree configurations
 * @{
 */
/**
 * @brief   Enables dynamic clock handling.
 */
#if !defined(STM32_CFG_CLOCK_DYNAMIC) || defined(__DOXYGEN__)
  #define STM32_CFG_CLOCK_DYNAMIC           FALSE
#endif

/**
 * @brief   Selects the core voltage scaling range.
 */
#if !defined(STM32_CFG_PWR_VOSR) || defined(__DOXYGEN__)
  #define STM32_CFG_PWR_VOSR                PWR_VOSR_VOS_RANGE1
#endif

/**
 * @brief   Selects the LSI oscillator output divider.
 */
#if !defined(STM32_CFG_LSI_PREDIV) || defined(__DOXYGEN__)
  #define STM32_CFG_LSI_PREDIV              RCC_BDCR_LSIPREDIV_DIV1
#endif

/**
 * @brief   Selects the external audio clock frequency.
 */
#if !defined(STM32_CFG_AUDIOCLK) || defined(__DOXYGEN__)
  #define STM32_CFG_AUDIOCLK                0U
#endif

/**
 * @brief   Selects the MSIS frequency range.
 */
#if !defined(STM32_CFG_MSIS_RANGE) || defined(__DOXYGEN__)
  #define STM32_CFG_MSIS_RANGE              RCC_ICSCR1_MSISRANGE_RANGE4_4M
#endif

/**
 * @brief   Selects the MSIK frequency range.
 */
#if !defined(STM32_CFG_MSIK_RANGE) || defined(__DOXYGEN__)
  #define STM32_CFG_MSIK_RANGE              RCC_ICSCR1_MSIKRANGE_RANGE4_4M
#endif

/**
 * @brief   Selects the MSI bias mode.
 */
#if !defined(STM32_CFG_MSIBIAS) || defined(__DOXYGEN__)
  #define STM32_CFG_MSIBIAS                 RCC_ICSCR1_MSIBIAS_CONTINUOUS
#endif

/**
 * @brief   Enables demand for the PLL1 P output clock.
 */
#if !defined(STM32_CFG_PLL1P_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL1P_REQUIRED          FALSE
#endif

/**
 * @brief   Enables demand for the PLL1 Q output clock.
 */
#if !defined(STM32_CFG_PLL1Q_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL1Q_REQUIRED          FALSE
#endif

/**
 * @brief   Enables demand for the PLL1 R output clock.
 */
#if !defined(STM32_CFG_PLL1R_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL1R_REQUIRED          FALSE
#endif

/**
 * @brief   Enables demand for the PLL2 P output clock.
 */
#if !defined(STM32_CFG_PLL2P_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL2P_REQUIRED          FALSE
#endif

/**
 * @brief   Enables demand for the PLL2 Q output clock.
 */
#if !defined(STM32_CFG_PLL2Q_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL2Q_REQUIRED          FALSE
#endif

/**
 * @brief   Enables demand for the PLL2 R output clock.
 */
#if !defined(STM32_CFG_PLL2R_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL2R_REQUIRED          FALSE
#endif

/**
 * @brief   Enables demand for the PLL3 P output clock.
 */
#if !defined(STM32_CFG_PLL3P_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL3P_REQUIRED          FALSE
#endif

/**
 * @brief   Enables demand for the PLL3 Q output clock.
 */
#if !defined(STM32_CFG_PLL3Q_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL3Q_REQUIRED          FALSE
#endif

/**
 * @brief   Enables demand for the PLL3 R output clock.
 */
#if !defined(STM32_CFG_PLL3R_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL3R_REQUIRED          FALSE
#endif

/**
 * @brief   Enables demand for the MDF1 clock.
 */
#if !defined(STM32_CFG_MDF1_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_MDF1_REQUIRED           FALSE
#endif

/**
 * @brief   Enables demand for the ADF1 clock.
 */
#if !defined(STM32_CFG_ADF1_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_ADF1_REQUIRED           FALSE
#endif

/**
 * @brief   Enables demand for the DAC1 sample-and-hold clock.
 */
#if !defined(STM32_CFG_DAC1SH_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_DAC1SH_REQUIRED         FALSE
#endif

/**
 * @brief   Enables demand for the LPTIM1 clock.
 */
#if !defined(STM32_CFG_LPTIM1_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM1_REQUIRED         FALSE
#endif

/**
 * @brief   Enables demand for the LPTIM2 clock.
 */
#if !defined(STM32_CFG_LPTIM2_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM2_REQUIRED         FALSE
#endif

/**
 * @brief   Enables demand for the LPTIM3 and LPTIM4 clocks.
 */
#if !defined(STM32_CFG_LPTIM34_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM34_REQUIRED        FALSE
#endif

/**
 * @brief   Enables the HSI16 clock source.
 */
#if !defined(STM32_CFG_HSI16_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_HSI16_ENABLE            FALSE
#endif

/**
 * @brief   Enables the HSI48 clock source.
 */
#if !defined(STM32_CFG_HSI48_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_HSI48_ENABLE            FALSE
#endif

/**
 * @brief   Enables the SHSI clock source.
 */
#if !defined(STM32_CFG_SHSI_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_SHSI_ENABLE             FALSE
#endif

/**
 * @brief   Enables the HSE clock source.
 */
#if !defined(STM32_CFG_HSE_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_HSE_ENABLE              FALSE
#endif

/**
 * @brief   Enables the LSE clock source.
 */
#if !defined(STM32_CFG_LSE_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_LSE_ENABLE              FALSE
#endif

/**
 * @brief   Enables the LSI clock source.
 */
#if !defined(STM32_CFG_LSI_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_LSI_ENABLE              FALSE
#endif

/**
 * @brief   Selects the PLL1IN clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - MSIS.
 *          - HSI16.
 *          - HSE.
 */
#if !defined(STM32_CFG_PLL1IN_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL1IN_SEL              RCC_PLL1CFGR_PLL1SRC_MSIS
#endif

/**
 * @brief   Configures the PLL1REF clock divider value.
 */
#if !defined(STM32_CFG_PLL1REF_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL1REF_VALUE           1
#endif

/**
 * @brief   Configures the PLL1VCO clock multiplier value.
 */
#if !defined(STM32_CFG_PLL1VCO_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL1VCO_VALUE           32
#endif

/**
 * @brief   Configures the PLL1P clock divider value.
 */
#if !defined(STM32_CFG_PLL1P_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL1P_VALUE             4
#endif

/**
 * @brief   Configures the PLL1Q clock divider value.
 */
#if !defined(STM32_CFG_PLL1Q_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL1Q_VALUE             4
#endif

/**
 * @brief   Configures the PLL1R clock divider value.
 */
#if !defined(STM32_CFG_PLL1R_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL1R_VALUE             4
#endif

/**
 * @brief   Selects the PLL2IN clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - MSIS.
 *          - HSI16.
 *          - HSE.
 */
#if !defined(STM32_CFG_PLL2IN_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL2IN_SEL              RCC_PLL2CFGR_PLL2SRC_MSIS
#endif

/**
 * @brief   Configures the PLL2REF clock divider value.
 */
#if !defined(STM32_CFG_PLL2REF_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL2REF_VALUE           1
#endif

/**
 * @brief   Configures the PLL2VCO clock multiplier value.
 */
#if !defined(STM32_CFG_PLL2VCO_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL2VCO_VALUE           32
#endif

/**
 * @brief   Configures the PLL2P clock divider value.
 */
#if !defined(STM32_CFG_PLL2P_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL2P_VALUE             4
#endif

/**
 * @brief   Configures the PLL2Q clock divider value.
 */
#if !defined(STM32_CFG_PLL2Q_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL2Q_VALUE             4
#endif

/**
 * @brief   Configures the PLL2R clock divider value.
 */
#if !defined(STM32_CFG_PLL2R_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL2R_VALUE             4
#endif

/**
 * @brief   Selects the PLL3IN clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - MSIS.
 *          - HSI16.
 *          - HSE.
 */
#if !defined(STM32_CFG_PLL3IN_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL3IN_SEL              RCC_PLL3CFGR_PLL3SRC_MSIS
#endif

/**
 * @brief   Configures the PLL3REF clock divider value.
 */
#if !defined(STM32_CFG_PLL3REF_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL3REF_VALUE           1
#endif

/**
 * @brief   Configures the PLL3VCO clock multiplier value.
 */
#if !defined(STM32_CFG_PLL3VCO_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL3VCO_VALUE           32
#endif

/**
 * @brief   Configures the PLL3P clock divider value.
 */
#if !defined(STM32_CFG_PLL3P_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL3P_VALUE             4
#endif

/**
 * @brief   Configures the PLL3Q clock divider value.
 */
#if !defined(STM32_CFG_PLL3Q_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL3Q_VALUE             4
#endif

/**
 * @brief   Configures the PLL3R clock divider value.
 */
#if !defined(STM32_CFG_PLL3R_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLL3R_VALUE             4
#endif

/**
 * @brief   Selects the SYSCLK clock source.
 * @note    Allowed sources:
 *          - MSIS.
 *          - HSI16.
 *          - HSE.
 *          - PLL1P.
 */
#if !defined(STM32_CFG_SYSCLK_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SYSCLK_SEL              RCC_CFGR1_SW_MSIS
#endif

/**
 * @brief   Configures the HCLK clock divider value.
 */
#if !defined(STM32_CFG_HCLK_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_HCLK_VALUE              1
#endif

/**
 * @brief   Configures the PCLK1 clock divider value.
 */
#if !defined(STM32_CFG_PCLK1_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PCLK1_VALUE             1
#endif

/**
 * @brief   Configures the PCLK2 clock divider value.
 */
#if !defined(STM32_CFG_PCLK2_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PCLK2_VALUE             1
#endif

/**
 * @brief   Configures the PCLK3 clock divider value.
 */
#if !defined(STM32_CFG_PCLK3_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PCLK3_VALUE             1
#endif

/**
 * @brief   Selects the RTC clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - LSE.
 *          - LSI.
 *          - HSEDIV.
 */
#if !defined(STM32_CFG_RTC_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_RTC_SEL                 RCC_BDCR_RTCSEL_NOCLOCK
#endif

/**
 * @brief   Selects the LSCO clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - LSI.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_LSCO_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LSCO_SEL                RCC_BDCR_LSCOSEL_NOCLOCK
#endif

/**
 * @brief   Selects the USART1 clock source.
 * @note    Allowed sources:
 *          - PCLK2.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_USART1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_USART1_SEL              RCC_CCIPR1_USART1SEL_PCLK2
#endif

/**
 * @brief   Selects the USART2 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_USART2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_USART2_SEL              RCC_CCIPR1_USART2SEL_PCLK1
#endif

/**
 * @brief   Selects the USART3 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_USART3_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_USART3_SEL              RCC_CCIPR1_USART3SEL_PCLK1
#endif

/**
 * @brief   Selects the UART4 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_UART4_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_UART4_SEL               RCC_CCIPR1_UART4SEL_PCLK1
#endif

/**
 * @brief   Selects the UART5 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_UART5_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_UART5_SEL               RCC_CCIPR1_UART5SEL_PCLK1
#endif

/**
 * @brief   Selects the LPUART1 clock source.
 * @note    Allowed sources:
 *          - PCLK3.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSESYS.
 *          - MSIK.
 */
#if !defined(STM32_CFG_LPUART1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPUART1_SEL             RCC_CCIPR3_LPUART1SEL_PCLK3
#endif

/**
 * @brief   Selects the I2C1 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I2C1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C1_SEL                RCC_CCIPR1_I2C1SEL_PCLK1
#endif

/**
 * @brief   Selects the I2C2 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I2C2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C2_SEL                RCC_CCIPR1_I2C2SEL_PCLK1
#endif

/**
 * @brief   Selects the I2C4 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I2C4_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C4_SEL                RCC_CCIPR1_I2C4SEL_PCLK1
#endif

/**
 * @brief   Selects the I2C3 clock source.
 * @note    Allowed sources:
 *          - PCLK3.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I2C3_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C3_SEL                RCC_CCIPR3_I2C3SEL_PCLK3
#endif

/**
 * @brief   Selects the SPI1 clock source.
 * @note    Allowed sources:
 *          - PCLK2.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_SPI1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SPI1_SEL                RCC_CCIPR1_SPI1SEL_PCLK2
#endif

/**
 * @brief   Selects the SPI2 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_SPI2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SPI2_SEL                RCC_CCIPR1_SPI2SEL_PCLK1
#endif

/**
 * @brief   Selects the SPI3 clock source.
 * @note    Allowed sources:
 *          - PCLK3.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_SPI3_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SPI3_SEL                RCC_CCIPR3_SPI3SEL_PCLK3
#endif

/**
 * @brief   Selects the FDCAN1 clock source.
 * @note    Allowed sources:
 *          - HSE.
 *          - PLL1Q.
 *          - PLL2P.
 *          - inactive selection RCC_CCIPR1_FDCANSEL_IGNORE.
 */
#if !defined(STM32_CFG_FDCAN1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_FDCAN1_SEL              RCC_CCIPR1_FDCANSEL_HSE
#endif

/**
 * @brief   Selects the ICLK clock source.
 * @note    Allowed sources:
 *          - HSI48.
 *          - PLL2Q.
 *          - PLL1Q.
 *          - MSIK.
 */
#if !defined(STM32_CFG_ICLK_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_ICLK_SEL                RCC_CCIPR1_ICLKSEL_HSI48
#endif

/**
 * @brief   Selects the SDMMC clock source.
 * @note    Allowed sources:
 *          - ICLK.
 *          - PLL1P.
 */
#if !defined(STM32_CFG_SDMMC_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SDMMC_SEL               RCC_CCIPR2_SDMMCSEL_ICLK
#endif

/**
 * @brief   Selects the OCTOSPI clock source.
 * @note    Allowed sources:
 *          - SYSCLK.
 *          - MSIK.
 *          - PLL1Q.
 *          - PLL2Q.
 *          - inactive selection RCC_CCIPR2_OCTOSPISEL_IGNORE.
 */
#if !defined(STM32_CFG_OCTOSPI_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_OCTOSPI_SEL             RCC_CCIPR2_OCTOSPISEL_SYSCLK
#endif

/**
 * @brief   Selects the RNG clock source.
 * @note    Allowed sources:
 *          - HSI48.
 *          - HSI48DIV2.
 *          - HSI16.
 *          - inactive selection RCC_CCIPR2_RNGSEL_IGNORE.
 */
#if !defined(STM32_CFG_RNG_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_RNG_SEL                 RCC_CCIPR2_RNGSEL_HSI48
#endif

/**
 * @brief   Selects the SAI1 clock source.
 * @note    Allowed sources:
 *          - PLL2P.
 *          - PLL3P.
 *          - PLL1P.
 *          - AUDIOCLK.
 *          - HSI16.
 *          - inactive selection RCC_CCIPR2_SAI1SEL_IGNORE.
 */
#if !defined(STM32_CFG_SAI1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SAI1_SEL                RCC_CCIPR2_SAI1SEL_PLL2P
#endif

/**
 * @brief   Selects the SAI2 clock source.
 * @note    Allowed sources:
 *          - PLL2P.
 *          - PLL3P.
 *          - PLL1P.
 *          - AUDIOCLK.
 *          - HSI16.
 *          - inactive selection RCC_CCIPR2_SAI2SEL_IGNORE.
 */
#if !defined(STM32_CFG_SAI2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SAI2_SEL                RCC_CCIPR2_SAI2SEL_PLL2P
#endif

/**
 * @brief   Selects the MDF1 clock source.
 * @note    Allowed sources:
 *          - HCLK.
 *          - PLL1P.
 *          - PLL3Q.
 *          - AUDIOCLK.
 *          - MSIK.
 *          - inactive selection RCC_CCIPR2_MDF1SEL_IGNORE.
 */
#if !defined(STM32_CFG_MDF1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_MDF1_SEL                RCC_CCIPR2_MDF1SEL_HCLK
#endif

/**
 * @brief   Selects the ADF1 clock source.
 * @note    Allowed sources:
 *          - HCLK.
 *          - PLL1P.
 *          - PLL3Q.
 *          - AUDIOCLK.
 *          - MSIK.
 *          - inactive selection RCC_CCIPR3_ADF1SEL_IGNORE.
 */
#if !defined(STM32_CFG_ADF1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_ADF1_SEL                RCC_CCIPR3_ADF1SEL_HCLK
#endif

/**
 * @brief   Selects the ADCDAC clock source.
 * @note    Allowed sources:
 *          - HCLK.
 *          - SYSCLK.
 *          - PLL2R.
 *          - HSE.
 *          - HSI16.
 *          - MSIK.
 *          - inactive selection RCC_CCIPR3_ADCDACSEL_IGNORE.
 */
#if !defined(STM32_CFG_ADCDAC_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_ADCDAC_SEL              RCC_CCIPR3_ADCDACSEL_HCLK
#endif

/**
 * @brief   Selects the DAC1SH clock source.
 * @note    Allowed sources:
 *          - LSESYS.
 *          - LSI.
 *          - inactive selection RCC_CCIPR3_DAC1SEL_IGNORE.
 */
#if !defined(STM32_CFG_DAC1SH_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_DAC1SH_SEL              RCC_CCIPR3_DAC1SEL_LSE
#endif

/**
 * @brief   Selects the LPTIM1 clock source.
 * @note    Allowed sources:
 *          - MSIK.
 *          - LSI.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_LPTIM1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM1_SEL              RCC_CCIPR3_LPTIM1SEL_MSIK
#endif

/**
 * @brief   Selects the LPTIM2 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - LSI.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_LPTIM2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM2_SEL              RCC_CCIPR1_LPTIM2SEL_PCLK1
#endif

/**
 * @brief   Selects the LPTIM34 clock source.
 * @note    Allowed sources:
 *          - MSIK.
 *          - LSI.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_LPTIM34_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM34_SEL             RCC_CCIPR3_LPTIM34SEL_MSIK
#endif
/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

/**
 * @name    Clock point derived constants and checks
 * @{
 */
/*
 * Extra configuration checks.
 */
#if !defined(TRUE) && !defined(__DOXYGEN__)
  #error "TRUE not defined"
#endif
#if !defined(FALSE) && !defined(__DOXYGEN__)
  #error "FALSE not defined"
#endif
#if !((STM32_CFG_CLOCK_DYNAMIC == TRUE) || (STM32_CFG_CLOCK_DYNAMIC == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_CLOCK_DYNAMIC value specified"
#endif

#if !defined(PWR_VOSR_VOS_RANGE1) && !defined(__DOXYGEN__)
  #error "PWR_VOSR_VOS_RANGE1 not defined"
#endif
#if !defined(PWR_VOSR_VOS_RANGE2) && !defined(__DOXYGEN__)
  #error "PWR_VOSR_VOS_RANGE2 not defined"
#endif
#if !defined(PWR_VOSR_VOS_RANGE3) && !defined(__DOXYGEN__)
  #error "PWR_VOSR_VOS_RANGE3 not defined"
#endif
#if !defined(PWR_VOSR_VOS_RANGE4) && !defined(__DOXYGEN__)
  #error "PWR_VOSR_VOS_RANGE4 not defined"
#endif
#if !((STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE1) ||                        \
     (STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE2) ||                         \
     (STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE3) ||                         \
     (STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE4)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PWR_VOSR value specified"
#endif

