qmk/ChibiOS/os/hal/ports/STM32/STM32U5xx/clocktree.h
/*
 * Derived configuration macros.
 */
#define STM32_DCFG_MSISRC_SEL               (STM32_CFG_MSIS_RANGE &         \
                                             (12U << RCC_ICSCR1_MSISRANGE_Pos))

#define STM32_DCFG_MSISDIV_VALUE            ((((STM32_CFG_MSIS_RANGE >> RCC_ICSCR1_MSISRANGE_Pos) & \
                                               3U) + 1U))

#define STM32_DCFG_MSIKRC_SEL               (STM32_CFG_MSIK_RANGE &         \
                                             (12U << RCC_ICSCR1_MSIKRANGE_Pos))

#define STM32_DCFG_MSIKDIV_VALUE            ((((STM32_CFG_MSIK_RANGE >> RCC_ICSCR1_MSIKRANGE_Pos) & \
                                               3U) + 1U))

/**
 * @name    Frequency limits for vos1 state
 * @{
 */
#if defined(STM32_HSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_HSECLK_MIN               4000000
#define STM32_VOS1_HSECLK_MAX               50000000
#else
#define STM32_VOS1_HSECLK_MIN               4000000
#define STM32_VOS1_HSECLK_MAX               50000000
#endif
#if defined(STM32_LSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_LSECLK_MIN               5000
#define STM32_VOS1_LSECLK_MAX               40000
#else
#define STM32_VOS1_LSECLK_MIN               32768
#define STM32_VOS1_LSECLK_MAX               32768
#endif
#define STM32_VOS1_PLLIN_MIN                4000000
#define STM32_VOS1_PLLIN_MAX                16000000
#define STM32_VOS1_PLLVCO_MIN               128000000
#define STM32_VOS1_PLLVCO_MAX               544000000
#define STM32_VOS1_PLLP_MIN                 1000000
#define STM32_VOS1_PLLP_MAX                 208000000
#define STM32_VOS1_PLLQ_MIN                 1000000
#define STM32_VOS1_PLLQ_MAX                 208000000
#define STM32_VOS1_PLLR_MIN                 1000000
#define STM32_VOS1_PLLR_MAX                 208000000
#define STM32_VOS1_SYSCLK_MAX               160000000
#define STM32_VOS1_HCLK_MAX                 160000000
#define STM32_VOS1_PCLK1_MAX                160000000
#define STM32_VOS1_PCLK2_MAX                160000000
#define STM32_VOS1_PCLK3_MAX                160000000
#define STM32_VOS1_ADCCLK_MAX               55000000
#define STM32_VOS1_USBCLK_MIN               47880000
#define STM32_VOS1_USBCLK_MAX               48120000
/** @} */

/**
 * @name    Frequency limits for vos2 state
 * @{
 */
#if defined(STM32_HSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS2_HSECLK_MIN               4000000
#define STM32_VOS2_HSECLK_MAX               50000000
#else
#define STM32_VOS2_HSECLK_MIN               4000000
#define STM32_VOS2_HSECLK_MAX               50000000
#endif
#if defined(STM32_LSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS2_LSECLK_MIN               5000
#define STM32_VOS2_LSECLK_MAX               40000
#else
#define STM32_VOS2_LSECLK_MIN               32768
#define STM32_VOS2_LSECLK_MAX               32768
#endif
#define STM32_VOS2_PLLIN_MIN                4000000
#define STM32_VOS2_PLLIN_MAX                16000000
#define STM32_VOS2_PLLVCO_MIN               128000000
#define STM32_VOS2_PLLVCO_MAX               544000000
#define STM32_VOS2_PLLP_MIN                 1000000
#define STM32_VOS2_PLLP_MAX                 110000000
#define STM32_VOS2_PLLQ_MIN                 1000000
#define STM32_VOS2_PLLQ_MAX                 110000000
#define STM32_VOS2_PLLR_MIN                 1000000
#define STM32_VOS2_PLLR_MAX                 110000000
#define STM32_VOS2_SYSCLK_MAX               110000000
#define STM32_VOS2_HCLK_MAX                 110000000
#define STM32_VOS2_PCLK1_MAX                110000000
#define STM32_VOS2_PCLK2_MAX                110000000
#define STM32_VOS2_PCLK3_MAX                110000000
#define STM32_VOS2_ADCCLK_MAX               55000000
#define STM32_VOS2_USBCLK_MIN               47880000
#define STM32_VOS2_USBCLK_MAX               48120000
/** @} */

/**
 * @name    Frequency limits for vos3 state
 * @{
 */
#if defined(STM32_HSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS3_HSECLK_MIN               4000000
#define STM32_VOS3_HSECLK_MAX               50000000
#else
#define STM32_VOS3_HSECLK_MIN               4000000
#define STM32_VOS3_HSECLK_MAX               50000000
#endif
#if defined(STM32_LSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS3_LSECLK_MIN               5000
#define STM32_VOS3_LSECLK_MAX               40000
#else
#define STM32_VOS3_LSECLK_MIN               32768
#define STM32_VOS3_LSECLK_MAX               32768
#endif
#define STM32_VOS3_PLLIN_MIN                4000000
#define STM32_VOS3_PLLIN_MAX                16000000
#define STM32_VOS3_PLLVCO_MIN               128000000
#define STM32_VOS3_PLLVCO_MAX               330000000
#define STM32_VOS3_PLLP_MIN                 1000000
#define STM32_VOS3_PLLP_MAX                 55000000
#define STM32_VOS3_PLLQ_MIN                 1000000
#define STM32_VOS3_PLLQ_MAX                 55000000
#define STM32_VOS3_PLLR_MIN                 1000000
#define STM32_VOS3_PLLR_MAX                 55000000
#define STM32_VOS3_SYSCLK_MAX               55000000
#define STM32_VOS3_HCLK_MAX                 55000000
#define STM32_VOS3_PCLK1_MAX                55000000
#define STM32_VOS3_PCLK2_MAX                55000000
#define STM32_VOS3_PCLK3_MAX                55000000
#define STM32_VOS3_ADCCLK_MAX               55000000
#define STM32_VOS3_USBCLK_MIN               47880000
#define STM32_VOS3_USBCLK_MAX               48120000
/** @} */

/**
 * @name    Frequency limits for vos4 state
 * @{
 */
#if defined(STM32_HSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS4_HSECLK_MIN               4000000
#define STM32_VOS4_HSECLK_MAX               25000000
#else
#define STM32_VOS4_HSECLK_MIN               4000000
#define STM32_VOS4_HSECLK_MAX               25000000
#endif
#if defined(STM32_LSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS4_LSECLK_MIN               5000
#define STM32_VOS4_LSECLK_MAX               40000
#else
#define STM32_VOS4_LSECLK_MIN               32768
#define STM32_VOS4_LSECLK_MAX               32768
#endif
#define STM32_VOS4_PLLIN_MIN                0
#define STM32_VOS4_PLLIN_MAX                0
#define STM32_VOS4_PLLVCO_MIN               0
#define STM32_VOS4_PLLVCO_MAX               0
#define STM32_VOS4_PLLP_MIN                 0
#define STM32_VOS4_PLLP_MAX                 0
#define STM32_VOS4_PLLQ_MIN                 0
#define STM32_VOS4_PLLQ_MAX                 0
#define STM32_VOS4_PLLR_MIN                 0
#define STM32_VOS4_PLLR_MAX                 0
#define STM32_VOS4_SYSCLK_MAX               25000000
#define STM32_VOS4_HCLK_MAX                 25000000
#define STM32_VOS4_PCLK1_MAX                25000000
#define STM32_VOS4_PCLK2_MAX                25000000
#define STM32_VOS4_PCLK3_MAX                25000000
#define STM32_VOS4_ADCCLK_MAX               25000000
#define STM32_VOS4_USBCLK_MIN               47880000
#define STM32_VOS4_USBCLK_MAX               48120000
/** @} */

