qmk/ChibiOS/os/hal/ports/STM32/STM32U5xx/clocktree.h
#if !((STM32_CFG_HSI16_ENABLE == TRUE) || (STM32_CFG_HSI16_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_HSI16_ENABLE value specified"
#endif

#if !defined(RCC_PLL1CFGR_PLL1SRC_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_PLL1CFGR_PLL1SRC_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_PLL1IN_ENABLED == TRUE) &&  \
      (STM32_CFG_PLL1IN_SEL == RCC_PLL1CFGR_PLL1SRC_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by PLL1IN"
#endif

#if !defined(RCC_PLL2CFGR_PLL2SRC_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_PLL2CFGR_PLL2SRC_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_PLL2IN_ENABLED == TRUE) &&  \
      (STM32_CFG_PLL2IN_SEL == RCC_PLL2CFGR_PLL2SRC_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by PLL2IN"
#endif

#if !defined(RCC_PLL3CFGR_PLL3SRC_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_PLL3CFGR_PLL3SRC_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_PLL3IN_ENABLED == TRUE) &&  \
      (STM32_CFG_PLL3IN_SEL == RCC_PLL3CFGR_PLL3SRC_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by PLL3IN"
#endif

#if !defined(RCC_CFGR1_SW_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_SW_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_SYSCLK_ENABLED == TRUE) &&  \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by SYSCLK"
#endif

#if !defined(RCC_CCIPR1_USART1SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_USART1SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_USART1_ENABLED == TRUE) &&  \
      (STM32_CFG_USART1_SEL == RCC_CCIPR1_USART1SEL_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by USART1"
#endif

#if !defined(RCC_CCIPR1_USART2SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_USART2SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_USART2_ENABLED == TRUE) &&  \
      (STM32_CFG_USART2_SEL == RCC_CCIPR1_USART2SEL_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by USART2"
#endif

#if !defined(RCC_CCIPR1_USART3SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_USART3SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_USART3_ENABLED == TRUE) &&  \
      (STM32_CFG_USART3_SEL == RCC_CCIPR1_USART3SEL_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by USART3"
#endif

#if !defined(RCC_CCIPR1_UART4SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_UART4SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_UART4_ENABLED == TRUE) &&   \
      (STM32_CFG_UART4_SEL == RCC_CCIPR1_UART4SEL_HSI16))) &&               \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by UART4"
#endif

#if !defined(RCC_CCIPR1_UART5SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_UART5SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_UART5_ENABLED == TRUE) &&   \
      (STM32_CFG_UART5_SEL == RCC_CCIPR1_UART5SEL_HSI16))) &&               \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by UART5"
#endif

#if !defined(RCC_CCIPR3_LPUART1SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR3_LPUART1SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_LPUART1_ENABLED == TRUE) && \
      (STM32_CFG_LPUART1_SEL == RCC_CCIPR3_LPUART1SEL_HSI16))) &&           \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by LPUART1"
#endif

#if !defined(RCC_CCIPR1_I2C1SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_I2C1SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_I2C1_ENABLED == TRUE) &&    \
      (STM32_CFG_I2C1_SEL == RCC_CCIPR1_I2C1SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by I2C1"
#endif

#if !defined(RCC_CCIPR1_I2C2SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_I2C2SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_I2C2_ENABLED == TRUE) &&    \
      (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by I2C2"
#endif

#if !defined(RCC_CCIPR1_I2C4SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_I2C4SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_I2C4_ENABLED == TRUE) &&    \
      (STM32_CFG_I2C4_SEL == RCC_CCIPR1_I2C4SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by I2C4"
#endif

#if !defined(RCC_CCIPR3_I2C3SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR3_I2C3SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_I2C3_ENABLED == TRUE) &&    \
      (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by I2C3"
#endif

#if !defined(RCC_CCIPR1_SPI1SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_SPI1SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_SPI1_ENABLED == TRUE) &&    \
      (STM32_CFG_SPI1_SEL == RCC_CCIPR1_SPI1SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by SPI1"
#endif

#if !defined(RCC_CCIPR1_SPI2SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_SPI2SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_SPI2_ENABLED == TRUE) &&    \
      (STM32_CFG_SPI2_SEL == RCC_CCIPR1_SPI2SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by SPI2"
#endif

#if !defined(RCC_CCIPR3_SPI3SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR3_SPI3SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_SPI3_ENABLED == TRUE) &&    \
      (STM32_CFG_SPI3_SEL == RCC_CCIPR3_SPI3SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by SPI3"
#endif

#if !defined(RCC_CCIPR2_RNGSEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR2_RNGSEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_RNG_ENABLED == TRUE) &&     \
      (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by RNG"
#endif

#if !defined(RCC_CCIPR2_SAI1SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR2_SAI1SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_SAI1_ENABLED == TRUE) &&    \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by SAI1"
#endif

#if !defined(RCC_CCIPR2_SAI2SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR2_SAI2SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_SAI2_ENABLED == TRUE) &&    \
      (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by SAI2"
#endif

#if !defined(RCC_CCIPR3_ADCDACSEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR3_ADCDACSEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_ADCDAC_ENABLED == TRUE) &&  \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by ADCDAC"
#endif

#if !defined(RCC_CCIPR3_LPTIM1SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR3_LPTIM1SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_LPTIM1_ENABLED == TRUE) &&  \
      (STM32_CFG_LPTIM1_SEL == RCC_CCIPR3_LPTIM1SEL_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by LPTIM1"
#endif

#if !defined(RCC_CCIPR1_LPTIM2SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_LPTIM2SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_LPTIM2_ENABLED == TRUE) &&  \
      (STM32_CFG_LPTIM2_SEL == RCC_CCIPR1_LPTIM2SEL_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by LPTIM2"
#endif

