qmk/ChibiOS/os/hal/ports/STM32/STM32U5xx/clocktree.h
#if !defined(RCC_CCIPR3_LPTIM34SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR3_LPTIM34SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_LPTIM34_ENABLED == TRUE) && \
      (STM32_CFG_LPTIM34_SEL == RCC_CCIPR3_LPTIM34SEL_HSI16))) &&           \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by LPTIM34"
#endif

/**
 * @brief   HSI16 nominal source frequency.
 */
#define STM32_HSI16_SOURCE_FREQ             16000000U

/**
 * @brief   HSI16 clock register bits.
 */
#if (STM32_HSI16_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_CR_HSI16_BITS               (RCC_CR_HSION | RCC_CR_HSIKERON)
#else
  #define STM32_CR_HSI16_BITS               0U
#endif

/**
 * @brief   16 MHz high speed internal oscillator clock point.
 */
#if (STM32_HSI16_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSI16_FREQ                  STM32_HSI16_SOURCE_FREQ
#else
  #define STM32_HSI16_FREQ                  0U
#endif

/*--- Macros and checks for the HSI48 clock point. -------------------------*/

#if !((STM32_CFG_HSI48_ENABLE == TRUE) || (STM32_CFG_HSI48_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_HSI48_ENABLE value specified"
#endif

#if !defined(RCC_CCIPR1_ICLKSEL_HSI48) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_ICLKSEL_HSI48 not defined"
#endif
#if !((STM32_HSI48_ENABLED == TRUE) || !((STM32_ICLK_ENABLED == TRUE) &&    \
      (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_HSI48))) && !defined(__DOXYGEN__)
  #error "HSI48 not enabled, required by ICLK"
#endif

#if !defined(STM32_HSI48DIV2_ENABLED) && !defined(__DOXYGEN__)
  #error "STM32_HSI48DIV2_ENABLED not defined"
#endif
#if !((STM32_HSI48_ENABLED == TRUE) || !((STM32_HSI48DIV2_ENABLED == TRUE))) && \
    !defined(__DOXYGEN__)
  #error "HSI48 not enabled, required by HSI48DIV2"
#endif

#if !defined(RCC_CCIPR2_RNGSEL_HSI48) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR2_RNGSEL_HSI48 not defined"
#endif
#if !((STM32_HSI48_ENABLED == TRUE) || !((STM32_RNG_ENABLED == TRUE) &&     \
      (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI48))) && !defined(__DOXYGEN__)
  #error "HSI48 not enabled, required by RNG"
#endif

/**
 * @brief   HSI48 nominal source frequency.
 */
#define STM32_HSI48_SOURCE_FREQ             48000000U

/**
 * @brief   HSI48 clock register bits.
 */
#if (STM32_HSI48_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_CR_HSI48_BITS               RCC_CR_HSI48ON
#else
  #define STM32_CR_HSI48_BITS               0U
#endif

/**
 * @brief   48 MHz high speed internal oscillator clock point.
 */
#if (STM32_HSI48_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSI48_FREQ                  STM32_HSI48_SOURCE_FREQ
#else
  #define STM32_HSI48_FREQ                  0U
#endif

/*--- Macros and checks for the SHSI clock point. --------------------------*/

#if !((STM32_CFG_SHSI_ENABLE == TRUE) || (STM32_CFG_SHSI_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SHSI_ENABLE value specified"
#endif

/**
 * @brief   SHSI nominal source frequency.
 */
#define STM32_SHSI_SOURCE_FREQ              48000000U

/**
 * @brief   SHSI clock register bits.
 */
#if (STM32_SHSI_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_CR_SHSI_BITS                RCC_CR_SHSION
#else
  #define STM32_CR_SHSI_BITS                0U
#endif

/**
 * @brief   48 MHz secure high speed internal oscillator clock point.
 */
#if (STM32_SHSI_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_SHSI_FREQ                   STM32_SHSI_SOURCE_FREQ
#else
  #define STM32_SHSI_FREQ                   0U
#endif

/*--- Macros and checks for the HSE clock point. ---------------------------*/

#if !((STM32_CFG_HSE_ENABLE == TRUE) || (STM32_CFG_HSE_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_HSE_ENABLE value specified"
#endif

#if !defined(RCC_PLL1CFGR_PLL1SRC_HSE) && !defined(__DOXYGEN__)
  #error "RCC_PLL1CFGR_PLL1SRC_HSE not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_PLL1IN_ENABLED == TRUE) &&    \
      (STM32_CFG_PLL1IN_SEL == RCC_PLL1CFGR_PLL1SRC_HSE))) &&               \
    !defined(__DOXYGEN__)
  #error "HSE not enabled, required by PLL1IN"
#endif

#if !defined(RCC_PLL2CFGR_PLL2SRC_HSE) && !defined(__DOXYGEN__)
  #error "RCC_PLL2CFGR_PLL2SRC_HSE not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_PLL2IN_ENABLED == TRUE) &&    \
      (STM32_CFG_PLL2IN_SEL == RCC_PLL2CFGR_PLL2SRC_HSE))) &&               \
    !defined(__DOXYGEN__)
  #error "HSE not enabled, required by PLL2IN"
#endif

#if !defined(RCC_PLL3CFGR_PLL3SRC_HSE) && !defined(__DOXYGEN__)
  #error "RCC_PLL3CFGR_PLL3SRC_HSE not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_PLL3IN_ENABLED == TRUE) &&    \
      (STM32_CFG_PLL3IN_SEL == RCC_PLL3CFGR_PLL3SRC_HSE))) &&               \
    !defined(__DOXYGEN__)
  #error "HSE not enabled, required by PLL3IN"
#endif

#if !defined(RCC_CFGR1_SW_HSE) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_SW_HSE not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_SYSCLK_ENABLED == TRUE) &&    \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_HSE))) && !defined(__DOXYGEN__)
  #error "HSE not enabled, required by SYSCLK"
#endif

#if !defined(STM32_HSEDIV_ENABLED) && !defined(__DOXYGEN__)
  #error "STM32_HSEDIV_ENABLED not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_HSEDIV_ENABLED == TRUE))) &&  \
    !defined(__DOXYGEN__)
  #error "HSE not enabled, required by HSEDIV"
#endif

#if !defined(RCC_CCIPR1_FDCANSEL_HSE) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_FDCANSEL_HSE not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_FDCAN1_ENABLED == TRUE) &&    \
      (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCANSEL_HSE))) && !defined(__DOXYGEN__)
  #error "HSE not enabled, required by FDCAN1"
#endif

#if !defined(RCC_CCIPR3_ADCDACSEL_HSE) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR3_ADCDACSEL_HSE not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_ADCDAC_ENABLED == TRUE) &&    \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_HSE))) &&               \
    !defined(__DOXYGEN__)
  #error "HSE not enabled, required by ADCDAC"
#endif

/**
 * @brief   HSE nominal source frequency.
 */
#define STM32_HSE_SOURCE_FREQ               STM32_HSECLK

/**
 * @brief   HSE clock register bits.
 */
#if (STM32_HSE_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_CR_HSE_BITS                 (RCC_CR_HSEON | STM32_HSE_MODE_BITS)
#else
  #define STM32_CR_HSE_BITS                 0U
#endif

/**
 * @brief   High speed external oscillator clock point.
 */
#if (STM32_HSE_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSE_FREQ                    STM32_HSE_SOURCE_FREQ
#else
  #define STM32_HSE_FREQ                    0U
#endif

#if !((STM32_HSE_ENABLED != TRUE) || (STM32_HSE_FREQ >= STM32_HSECLK_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_HSE_FREQ below minimum frequency"
#endif

