qmk/ChibiOS/os/hal/ports/STM32/STM32U5xx/clocktree.h
/*--- Macros and checks for the SDMMC2 clock point. ------------------------*/

/**
 * @brief   SDMMC2 clock register bits.
 */
#define STM32_SDMMC2_BITS                   0U

/**
 * @brief   SDMMC2 clock clock point.
 */
#if (STM32_SDMMC2_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_SDMMC2_FREQ                 STM32_SDMMC_FREQ
#else
  #define STM32_SDMMC2_FREQ                 0U
#endif

/*--- Macros and checks for the OCTOSPI clock point. -----------------------*/

/**
 * @brief   OCTOSPI clock register bits.
 */
#if (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_SYSCLK) ||              \
    defined(__DOXYGEN__)
  #if (STM32_OCTOSPI_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_OCTOSPI_BITS              RCC_CCIPR2_OCTOSPISEL_SYSCLK
  #else
    #define STM32_OCTOSPI_BITS              0U
  #endif
#elif (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_MSIK)
  #if (STM32_OCTOSPI_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_OCTOSPI_BITS              RCC_CCIPR2_OCTOSPISEL_MSIK
  #else
    #define STM32_OCTOSPI_BITS              0U
  #endif
#elif (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_PLL1Q)
  #if (STM32_OCTOSPI_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_OCTOSPI_BITS              RCC_CCIPR2_OCTOSPISEL_PLL1Q
  #else
    #define STM32_OCTOSPI_BITS              0U
  #endif
#elif (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_PLL2Q)
  #if (STM32_OCTOSPI_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_OCTOSPI_BITS              RCC_CCIPR2_OCTOSPISEL_PLL2Q
  #else
    #define STM32_OCTOSPI_BITS              0U
  #endif
#elif (STM32_OCTOSPI_ENABLED == FALSE) &&                                   \
      (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_IGNORE)
  #define STM32_OCTOSPI_BITS                0U
#else
  #error "invalid STM32_CFG_OCTOSPI_SEL value specified"
#endif

/**
 * @brief   OCTOSPI clock clock point.
 */
#if ((STM32_OCTOSPI_ENABLED == TRUE) && \
     (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_SYSCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_OCTOSPI_FREQ                STM32_SYSCLK_FREQ
#elif (STM32_OCTOSPI_ENABLED == TRUE) && \
      (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_MSIK)
  #define STM32_OCTOSPI_FREQ                STM32_MSIK_FREQ
#elif (STM32_OCTOSPI_ENABLED == TRUE) && \
      (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_PLL1Q)
  #define STM32_OCTOSPI_FREQ                STM32_PLL1Q_FREQ
#elif (STM32_OCTOSPI_ENABLED == TRUE) && \
      (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_PLL2Q)
  #define STM32_OCTOSPI_FREQ                STM32_PLL2Q_FREQ
#else
  #define STM32_OCTOSPI_FREQ                0U
#endif

/*--- Macros and checks for the HSI48DIV2 clock point. ---------------------*/

/**
 * @brief   HSI48DIV2 clock register bits.
 */
#define STM32_HSI48DIV2_BITS                0U

/**
 * @brief   HSI48 divided by 2 clock clock point.
 */
#if (STM32_HSI48DIV2_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSI48DIV2_FREQ              (STM32_HSI48_FREQ / 2U)
#else
  #define STM32_HSI48DIV2_FREQ              0U
#endif

/*--- Macros and checks for the RNG clock point. ---------------------------*/

/**
 * @brief   RNG clock register bits.
 */
#if (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI48) || defined(__DOXYGEN__)
  #if (STM32_RNG_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_RNG_BITS                  RCC_CCIPR2_RNGSEL_HSI48
  #else
    #define STM32_RNG_BITS                  0U
  #endif
#elif (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI48DIV2)
  #if (STM32_RNG_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_RNG_BITS                  RCC_CCIPR2_RNGSEL_HSI48DIV2
  #else
    #define STM32_RNG_BITS                  0U
  #endif
#elif (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI16)
  #if (STM32_RNG_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_RNG_BITS                  RCC_CCIPR2_RNGSEL_HSI16
  #else
    #define STM32_RNG_BITS                  0U
  #endif
#elif (STM32_RNG_ENABLED == FALSE) &&                                       \
      (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_IGNORE)
  #define STM32_RNG_BITS                    0U
#else
  #error "invalid STM32_CFG_RNG_SEL value specified"
#endif

/**
 * @brief   RNG clock clock point.
 */
#if ((STM32_RNG_ENABLED == TRUE) && \
     (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI48)) || \
    defined(__DOXYGEN__)
  #define STM32_RNG_FREQ                    STM32_HSI48_FREQ
#elif (STM32_RNG_ENABLED == TRUE) && \
      (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI48DIV2)
  #define STM32_RNG_FREQ                    STM32_HSI48DIV2_FREQ
#elif (STM32_RNG_ENABLED == TRUE) && \
      (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI16)
  #define STM32_RNG_FREQ                    STM32_HSI16_FREQ
#else
  #define STM32_RNG_FREQ                    0U
#endif

/*--- Macros and checks for the SAI1 clock point. --------------------------*/

/**
 * @brief   SAI1 clock register bits.
 */
#if (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_PLL2P) || defined(__DOXYGEN__)
  #if (STM32_SAI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI1_BITS                 RCC_CCIPR2_SAI1SEL_PLL2P
  #else
    #define STM32_SAI1_BITS                 0U
  #endif
#elif (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_PLL3P)
  #if (STM32_SAI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI1_BITS                 RCC_CCIPR2_SAI1SEL_PLL3P
  #else
    #define STM32_SAI1_BITS                 0U
  #endif
#elif (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_PLL1P)
  #if (STM32_SAI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI1_BITS                 RCC_CCIPR2_SAI1SEL_PLL1P
  #else
    #define STM32_SAI1_BITS                 0U
  #endif
#elif (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_AUDIOCLK)
  #if (STM32_SAI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI1_BITS                 RCC_CCIPR2_SAI1SEL_AUDIOCLK
  #else
    #define STM32_SAI1_BITS                 0U
  #endif
#elif (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_HSI16)
  #if (STM32_SAI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI1_BITS                 RCC_CCIPR2_SAI1SEL_HSI16
  #else
    #define STM32_SAI1_BITS                 0U
  #endif
#elif (STM32_SAI1_ENABLED == FALSE) &&                                      \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_IGNORE)
  #define STM32_SAI1_BITS                   0U
#else
  #error "invalid STM32_CFG_SAI1_SEL value specified"
#endif

/**
 * @brief   SAI1 clock clock point.
 */
#if ((STM32_SAI1_ENABLED == TRUE) && \
     (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_PLL2P)) || \
    defined(__DOXYGEN__)
  #define STM32_SAI1_FREQ                   STM32_PLL2P_FREQ
#elif (STM32_SAI1_ENABLED == TRUE) && \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_PLL3P)
  #define STM32_SAI1_FREQ                   STM32_PLL3P_FREQ
#elif (STM32_SAI1_ENABLED == TRUE) && \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_PLL1P)
  #define STM32_SAI1_FREQ                   STM32_PLL1P_FREQ
#elif (STM32_SAI1_ENABLED == TRUE) && \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_AUDIOCLK)
  #define STM32_SAI1_FREQ                   STM32_AUDIOCLK_FREQ
#elif (STM32_SAI1_ENABLED == TRUE) && \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_HSI16)
  #define STM32_SAI1_FREQ                   STM32_HSI16_FREQ
#else
  #define STM32_SAI1_FREQ                   0U
#endif

/*--- Macros and checks for the SAI2 clock point. --------------------------*/

/**
 * @brief   SAI2 clock register bits.
 */
#if (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_PLL2P) || defined(__DOXYGEN__)
  #if (STM32_SAI2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI2_BITS                 RCC_CCIPR2_SAI2SEL_PLL2P
  #else
    #define STM32_SAI2_BITS                 0U
  #endif
#elif (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_PLL3P)
  #if (STM32_SAI2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI2_BITS                 RCC_CCIPR2_SAI2SEL_PLL3P
  #else
    #define STM32_SAI2_BITS                 0U
  #endif
#elif (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_PLL1P)
  #if (STM32_SAI2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI2_BITS                 RCC_CCIPR2_SAI2SEL_PLL1P
  #else
    #define STM32_SAI2_BITS                 0U
  #endif
#elif (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_AUDIOCLK)
  #if (STM32_SAI2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI2_BITS                 RCC_CCIPR2_SAI2SEL_AUDIOCLK
  #else
    #define STM32_SAI2_BITS                 0U
  #endif
#elif (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_HSI16)
  #if (STM32_SAI2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI2_BITS                 RCC_CCIPR2_SAI2SEL_HSI16
  #else
    #define STM32_SAI2_BITS                 0U
  #endif
#elif (STM32_SAI2_ENABLED == FALSE) &&                                      \
      (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_IGNORE)
  #define STM32_SAI2_BITS                   0U
#else
  #error "invalid STM32_CFG_SAI2_SEL value specified"
#endif

/**
 * @brief   SAI2 clock clock point.
 */
#if ((STM32_SAI2_ENABLED == TRUE) && \
     (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_PLL2P)) || \
    defined(__DOXYGEN__)
  #define STM32_SAI2_FREQ                   STM32_PLL2P_FREQ
#elif (STM32_SAI2_ENABLED == TRUE) && \
      (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_PLL3P)
  #define STM32_SAI2_FREQ                   STM32_PLL3P_FREQ
#elif (STM32_SAI2_ENABLED == TRUE) && \
      (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_PLL1P)
  #define STM32_SAI2_FREQ                   STM32_PLL1P_FREQ
#elif (STM32_SAI2_ENABLED == TRUE) && \
      (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_AUDIOCLK)
  #define STM32_SAI2_FREQ                   STM32_AUDIOCLK_FREQ
#elif (STM32_SAI2_ENABLED == TRUE) && \
      (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_HSI16)
  #define STM32_SAI2_FREQ                   STM32_HSI16_FREQ
#else
  #define STM32_SAI2_FREQ                   0U
#endif

/*--- Macros and checks for the MDF1 clock point. --------------------------*/

/**
 * @brief   MDF1 clock register bits.
 */
#if (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_HCLK) || defined(__DOXYGEN__)
  #if (STM32_MDF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MDF1_BITS                 RCC_CCIPR2_MDF1SEL_HCLK
  #else
    #define STM32_MDF1_BITS                 0U
  #endif
#elif (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_PLL1P)
  #if (STM32_MDF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MDF1_BITS                 RCC_CCIPR2_MDF1SEL_PLL1P
  #else
    #define STM32_MDF1_BITS                 0U
  #endif
#elif (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_PLL3Q)
  #if (STM32_MDF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MDF1_BITS                 RCC_CCIPR2_MDF1SEL_PLL3Q
  #else
    #define STM32_MDF1_BITS                 0U
  #endif
#elif (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_AUDIOCLK)
  #if (STM32_MDF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MDF1_BITS                 RCC_CCIPR2_MDF1SEL_AUDIOCLK
  #else
    #define STM32_MDF1_BITS                 0U
  #endif
#elif (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_MSIK)
  #if (STM32_MDF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MDF1_BITS                 RCC_CCIPR2_MDF1SEL_MSIK
  #else
    #define STM32_MDF1_BITS                 0U
  #endif
#elif (STM32_MDF1_ENABLED == FALSE) &&                                      \
      (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_IGNORE)
  #define STM32_MDF1_BITS                   0U
#else
  #error "invalid STM32_CFG_MDF1_SEL value specified"
#endif

/**
 * @brief   MDF1 clock clock point.
 */
#if ((STM32_MDF1_ENABLED == TRUE) && \
     (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_HCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_MDF1_FREQ                   STM32_HCLK_FREQ
#elif (STM32_MDF1_ENABLED == TRUE) && \
      (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_PLL1P)
  #define STM32_MDF1_FREQ                   STM32_PLL1P_FREQ
#elif (STM32_MDF1_ENABLED == TRUE) && \
      (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_PLL3Q)
  #define STM32_MDF1_FREQ                   STM32_PLL3Q_FREQ
#elif (STM32_MDF1_ENABLED == TRUE) && \
      (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_AUDIOCLK)
  #define STM32_MDF1_FREQ                   STM32_AUDIOCLK_FREQ
#elif (STM32_MDF1_ENABLED == TRUE) && \
      (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_MSIK)
  #define STM32_MDF1_FREQ                   STM32_MSIK_FREQ
#else
  #define STM32_MDF1_FREQ                   0U
#endif

/*--- Macros and checks for the ADF1 clock point. --------------------------*/

/**
 * @brief   ADF1 clock register bits.
 */
#if (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_HCLK) || defined(__DOXYGEN__)
  #if (STM32_ADF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADF1_BITS                 RCC_CCIPR3_ADF1SEL_HCLK
  #else
    #define STM32_ADF1_BITS                 0U
  #endif
#elif (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_PLL1P)
  #if (STM32_ADF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADF1_BITS                 RCC_CCIPR3_ADF1SEL_PLL1P
  #else
    #define STM32_ADF1_BITS                 0U
  #endif
#elif (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_PLL3Q)
  #if (STM32_ADF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADF1_BITS                 RCC_CCIPR3_ADF1SEL_PLL3Q
  #else
    #define STM32_ADF1_BITS                 0U
  #endif
#elif (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_AUDIOCLK)
  #if (STM32_ADF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADF1_BITS                 RCC_CCIPR3_ADF1SEL_AUDIOCLK
  #else
    #define STM32_ADF1_BITS                 0U
  #endif
#elif (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_MSIK)
  #if (STM32_ADF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADF1_BITS                 RCC_CCIPR3_ADF1SEL_MSIK
  #else
    #define STM32_ADF1_BITS                 0U
  #endif
#elif (STM32_ADF1_ENABLED == FALSE) &&                                      \
      (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_IGNORE)
  #define STM32_ADF1_BITS                   0U
#else
  #error "invalid STM32_CFG_ADF1_SEL value specified"
#endif

/**
 * @brief   ADF1 clock clock point.
 */
#if ((STM32_ADF1_ENABLED == TRUE) && \
     (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_HCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_ADF1_FREQ                   STM32_HCLK_FREQ
#elif (STM32_ADF1_ENABLED == TRUE) && \
      (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_PLL1P)
  #define STM32_ADF1_FREQ                   STM32_PLL1P_FREQ
#elif (STM32_ADF1_ENABLED == TRUE) && \
      (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_PLL3Q)
  #define STM32_ADF1_FREQ                   STM32_PLL3Q_FREQ
#elif (STM32_ADF1_ENABLED == TRUE) && \
      (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_AUDIOCLK)
  #define STM32_ADF1_FREQ                   STM32_AUDIOCLK_FREQ
#elif (STM32_ADF1_ENABLED == TRUE) && \
      (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_MSIK)
  #define STM32_ADF1_FREQ                   STM32_MSIK_FREQ
#else
  #define STM32_ADF1_FREQ                   0U
#endif

/*--- Macros and checks for the ADCDAC clock point. ------------------------*/

/**
 * @brief   ADCDAC clock register bits.
 */
#if (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_HCLK) || defined(__DOXYGEN__)
  #if (STM32_ADCDAC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDAC_BITS               RCC_CCIPR3_ADCDACSEL_HCLK
  #else
    #define STM32_ADCDAC_BITS               0U
  #endif
#elif (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_SYSCLK)
  #if (STM32_ADCDAC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDAC_BITS               RCC_CCIPR3_ADCDACSEL_SYSCLK
  #else
    #define STM32_ADCDAC_BITS               0U
  #endif
#elif (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_PLL2R)
  #if (STM32_ADCDAC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDAC_BITS               RCC_CCIPR3_ADCDACSEL_PLL2R
  #else
    #define STM32_ADCDAC_BITS               0U
  #endif
#elif (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_HSE)
  #if (STM32_ADCDAC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDAC_BITS               RCC_CCIPR3_ADCDACSEL_HSE
  #else
    #define STM32_ADCDAC_BITS               0U
  #endif
#elif (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_HSI16)
  #if (STM32_ADCDAC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDAC_BITS               RCC_CCIPR3_ADCDACSEL_HSI16
  #else
    #define STM32_ADCDAC_BITS               0U
  #endif
#elif (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_MSIK)
  #if (STM32_ADCDAC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDAC_BITS               RCC_CCIPR3_ADCDACSEL_MSIK
  #else
    #define STM32_ADCDAC_BITS               0U
  #endif
#elif (STM32_ADCDAC_ENABLED == FALSE) &&                                    \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_IGNORE)
  #define STM32_ADCDAC_BITS                 0U
#else
  #error "invalid STM32_CFG_ADCDAC_SEL value specified"
#endif

/**
 * @brief   ADC and DAC clock clock point.
 */
#if ((STM32_ADCDAC_ENABLED == TRUE) && \
     (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_HCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_ADCDAC_FREQ                 STM32_HCLK_FREQ
#elif (STM32_ADCDAC_ENABLED == TRUE) && \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_SYSCLK)
  #define STM32_ADCDAC_FREQ                 STM32_SYSCLK_FREQ
#elif (STM32_ADCDAC_ENABLED == TRUE) && \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_PLL2R)
  #define STM32_ADCDAC_FREQ                 STM32_PLL2R_FREQ
#elif (STM32_ADCDAC_ENABLED == TRUE) && \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_HSE)
  #define STM32_ADCDAC_FREQ                 STM32_HSE_FREQ
#elif (STM32_ADCDAC_ENABLED == TRUE) && \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_HSI16)
  #define STM32_ADCDAC_FREQ                 STM32_HSI16_FREQ
#elif (STM32_ADCDAC_ENABLED == TRUE) && \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_MSIK)
  #define STM32_ADCDAC_FREQ                 STM32_MSIK_FREQ
#else
  #define STM32_ADCDAC_FREQ                 0U
#endif

#if !defined(RCC_CCIPR3_ADCDACSEL_HCLK) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR3_ADCDACSEL_HCLK not defined"
#endif
#if !(!((STM32_ADCDAC_ENABLED == TRUE) &&                                   \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_HCLK)) ||               \
     (STM32_HCLK_FREQ <= STM32_ADCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_ADCDAC_FREQ above maximum frequency"
#endif

#if !defined(RCC_CCIPR3_ADCDACSEL_SYSCLK) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR3_ADCDACSEL_SYSCLK not defined"
#endif
#if !(!((STM32_ADCDAC_ENABLED == TRUE) &&                                   \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_SYSCLK)) ||             \
     (STM32_SYSCLK_FREQ <= STM32_ADCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_ADCDAC_FREQ above maximum frequency"
#endif

#if !defined(RCC_CCIPR3_ADCDACSEL_PLL2R) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR3_ADCDACSEL_PLL2R not defined"
#endif
#if !(!((STM32_ADCDAC_ENABLED == TRUE) &&                                   \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_PLL2R)) ||              \
     (STM32_PLL2R_FREQ <= STM32_ADCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_ADCDAC_FREQ above maximum frequency"
#endif

#if !(!((STM32_ADCDAC_ENABLED == TRUE) &&                                   \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_HSE)) ||                \
     (STM32_HSE_FREQ <= STM32_ADCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_ADCDAC_FREQ above maximum frequency"
#endif

#if !(!((STM32_ADCDAC_ENABLED == TRUE) &&                                   \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_HSI16)) ||              \
     (STM32_HSI16_FREQ <= STM32_ADCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_ADCDAC_FREQ above maximum frequency"
#endif

#if !defined(RCC_CCIPR3_ADCDACSEL_MSIK) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR3_ADCDACSEL_MSIK not defined"
#endif
#if !(!((STM32_ADCDAC_ENABLED == TRUE) &&                                   \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_MSIK)) ||               \
     (STM32_MSIK_FREQ <= STM32_ADCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_ADCDAC_FREQ above maximum frequency"
#endif

